{"338518":{"success":true,"data":{"type":"dlc","name":"WARMACHINE: Tactics - Mercenaries Faction Bundle","steam_appid":338518,"required_age":0,"is_free":false,"detailed_description":"<strong>Magnus the Traitor<\/strong><br><br><i>“By my sword and the blood of my enemies, I will leave an immortal legacy.”<\/i><br><br>Asheth Magnus works with the inexhaustible energy of a man utterly devoted to his purpose, which is survival and revenge. Once a loyal servant of Cygnar’s deposed king, Vinter Raelthorne, Magnus now sells his services to the highest bidder as he bides his time, preparing for the return of his exiled liege. A formidable warcaster and unparalleled tactician, Magnus’ mastery of warfare is as feared as it is in demand throughout the Iron Kingdoms. <br><br><strong>SPD: <\/strong>5  <br><strong>MAT:<\/strong> 3  <br><strong>RAT:<\/strong> 1  <br><strong>MAG:<\/strong> 2  <br><strong>DEF:<\/strong> 3  <br><strong>ARM: <\/strong>3  <br><strong>FOCUS: <\/strong>6<br> <br><strong>Weapons:<\/strong> Foecleaver, Mechanikal Arm, Scattergun<br> <br><strong>Abilities and Advantages:<\/strong> Feign Death, Backstab, Resourceful<br> <br><strong>Spells: <\/strong>Arcantrik Bolt, Blur, Iron Aggression, Obliteration, Temper Metal, Snipe<br> <br><strong>Feat: <\/strong>Hit and Run<br> <br>Magnus the Traitor will work for Cryx, Khador, and the Protectorate of Menoth.<br> <br>Magnus is viewed as criminal and traitor to the majority of the population of Cygnar. Nothing could be further from the truth. A consummate patriot, every action Magnus has ever taken has been to preserve the country he loves. This includes leading a guerilla war against his former countrymen with the final goal of restoring Vinter Raelthorne IV to the throne. In terms of patriotism, it is only Magnus’ faith in the deposed despot that is questionable. Magnus now sells his skills as a commander and warcaster to any who can afford him, but he never takes a job that does not advance his underlying goal of restoring Cygnar to its former glory.<br> <br>As a product of the Cygnaran Royal Academy and a genius with mechanika rivalling the likes of Sebastian Nemo, Dominic Darius and Arlan Strangeways, Magnus the Traitor is second-to-none at supporting warjacks. At the Cygnaran Royal Academy, Magnus mastered staple spells that increase the range of his army’s guns and protect it from opposing guns and spells. On the other hand, his mechanikal genius grants him the ability to impart unparalleled aggression in his warjacks, cause any enemy warjack to seize up, and even magically temper ‘jack armor to greater resilience. When the time is right, Magnus can impart his hit-and-run tactics to his warjacks. He and his battlegroup lay waste to prime targets and are far out of reach before his enemies know what hit them.<br><br><br><strong>Drake MacBain<\/strong><br><br><strong>SPD:<\/strong>6<br><strong>MAT:<\/strong> 2  <br><strong>RAT:<\/strong> 1  <br><strong>MAG:<\/strong> 2  <br><strong>DEF:<\/strong> 4<br><strong>ARM:<\/strong> 2  <br><strong>FOCUS:<\/strong> 6<br> <br><strong>Weapons:<\/strong> Hand Cannon, Undertaker<br> <br><strong>Abilities and Advantages:<\/strong> Tough, Gang Fighter, Unyielding<br> <br><strong>Spells: <\/strong>Countermeasure, Energizer, Failsafe, Fortune, Jackhammer, Rift<br> <br><strong>Feat: <\/strong>True Grit<br><br>MacBain is a shrewd combatant willing to use every trick and improvised stratagem he can manage to assure victory. Years at war making do with whatever warjacks and men he can muster have made him an expert in exploiting his enemy’s weaknesses. He has a reputation for being a stickler with contracts and adheres to their particulars with stubborn devotion. When he signs his name to commit to a task, he delivers on that promise, and this reliability has earned him such constant work that he regularly has to turn offers away. Those who fight with him know he truly loves his job and is never happier than when extricating himself from some deadly situation.<br><br>Having grown up on the street, and having had no formal training as a Warcaster, MacBain’s selection of abilities might seem like a haphazard combination of random stuff, but, as with most Mercenary Warcasters, they all are worth more than the sum of their parts, and add to the flavor of his character as well.<br><br><br><strong>Ashlynn D'Elyse<\/strong><br><br><strong>SPD:<\/strong>6<br><strong>MAT:<\/strong> 4<br><strong>RAT:<\/strong> 2 <br><strong>MAG:<\/strong> 2  <br><strong>DEF:<\/strong> 5<br><strong>ARM:<\/strong> 2  <br><strong>FOCUS:<\/strong> 6<br> <br><strong>Weapons:<\/strong> Hand Cannon, Nemesis<br> <br><strong>Abilities and Advantages:<\/strong> Gunfighter, Parry, Quick Draw, Riposte, Virtuoso<br> <br><strong>Spells: <\/strong>Admonition, Distraction, Flashing Blade, Gallows, Quicken, Twister<br> <br><strong>Feat: <\/strong>Roulette<br><br>Before the occupation of Llael, Ashlynn grew up as a member of a noble family, receiving much training both at military academies and targeting ranges. During her adolescence, she was discovered as a Warcaster and started serving the nation. After her father was executed during the Khadoran invasion, she started doing freelance work in order to fund incursions against the Khadorans.<br><br>Ashlynn is a duelist-type character. This is seen through several aspects of her abilities, most notably her high Defense, the highest in the game, as well as some defensive passive abilities, and some impressively devastating offensive tricks. Her entire game plan revolves around sticking a pin in the wheel of the opponent’s plans and capitalizing on the mistakes caused thereby.<br><br><br><strong>Mangler Warjack<\/strong><br><br>Originally hammered together from an assortment of scrap materials, the Mangler has quickly become a favored heavy warjack chassis among the mercenary companies of the Iron Kingdoms. Equipped with a massive spiked ball of riveted iron, the Mangler can smash through enemy formations in a single swing. The huge spike on its left arm is wicked in close combat and also leaves its hand open to execute throw power-attacks, making the Mangler as versatile as it is deadly.<br><br><strong>SPD: <\/strong>5  <br><strong>MAT:<\/strong> 2  <br><strong>RAT:<\/strong> - <br><strong>DEF: <\/strong>- <br><strong>ARM:<\/strong> 4<br> <br><strong>Weapons:<\/strong> Wrecker, Punching Spike<br> <br><strong>Abilities and Advantages:<\/strong> Thresher, Open Fist<br> <br>Mangler warjacks can be included in the battlegroup of any Mercenary warcaster.<br> <br>The Mangler warjack is one of Asheth Magnus’ custom-built wonders. It is an all-comers heavy melee warjack. Much like the Renegade light warjack, Magnus bolted the first of these mechanikal bruisers together with looted ‘jack parts. With nothing but dedicated melee brutality in mind, he built the Mangler to handle any close combat situation. Since the heavy warjack does not use any of the expensive components that the Renegade does, it can be found in the battlegroups of mercenaries across the Iron Kingdoms.<br> <br>The Mangler heavy warjack has everything a battlegroup commander needs in a melee warjack. It is heavily armored and carries a massive wrecker ball so it can go toe-to-toe with other heavies. The Wrecker is attached to a long chain, allowing it to get around shields and punch through phalanxes. The Mangler can flail the Wrecker about and devastate tight infantry formations. The punching spike on the back of its other arm is a credible secondary threat that also leaves the Mangler’s fist free to grab hold of enemies.<br><br><br><strong>Renegade Warjack<\/strong><br><br>Asheth Magnus’ magnum opus is a testament to his intuitive skill with mechanika. Based on the chassis of decommissioned Cygnaran ‘jacks, the Renegade exemplifies Magnus’ approach to war: overwhelming aggression accompanied by a total commitment to each battle. Armed with a savage chain-driven shredder scrapsaw and a one-shot obliterator rocket, whose powerful concussive blasts are able to toss troops like ragdolls, the Renegade is devastating in both close combat and from afar. But its most valuable feature is its arc node, allowing Magnus to channel spells from a distance — a coveted ability unique among mercenaries in the Iron Kingdoms.<br><br><strong>SPD: <\/strong>5  <br><strong>MAT: <\/strong>2  <br><strong>RAT: <\/strong>2  <br><strong>DEF:<\/strong> -  <br><strong>ARM:<\/strong> 4<br> <br>Weapons: Shredder, Obliterator (rocket)<br> <br>Abilities and Advantages: Arc Node<br> <br>Renegade warjacks can be included in the battlegroup of Magnus.<br> <br>The Renegade light warjack is testament to the ingenuity of Asheth Magnus. These amazing light warjacks are never seen outside of a battlegroup controlled by Magnus. He would have to lose an engagement where one was left intact for anyone else to get their hands on one. If Magnus still has a Renegade intact, he probably is not losing. After cobbling the first Renegades together out of battlefield salvage, Magnus, through lucrative employment and personal opportunities, acquired the resources for dedicated production of Renegades and his other custom warjacks.<br> <br>Arc nodes are normally only available to the greatest, wealthiest kingdoms. Even the prodigious means and resources of the Steelhead Mercenary Company do not afford them access to warjacks with Arc Nodes unless they have a contract with Magnus. Magnus’ mechanikal ability includes the ability to build arc nodes from scratch if necessary, allowing him to incorporate them in the design of the Renegade. The Renegade allows Magnus to support his warjacks and armies from tactical, unassailable positions before and after the Renegade delivers its deadly payload. The Renegade’s ranged weapon is an expensive, one-shot alchemical wonder that knocks anything within its blast radius into the dirt. Whatever is still moving has to face the Renegade’s whirring chain blade that, once it bites, saws metal or bone to bits.<br><br><br><strong>Talon Warjack<\/strong><br><br>Originally developed as a frontline Cygnaran warjack, the Talon is a common sight in today’s black markets and salvage yards. Though retired from the Cygnaran armory in favor of more technologically advanced chassis, the Talon remains a favorite among mercenary companies for its reliable effectiveness in almost any situation. The Talon’s Stun Lance, while lethal against soldiers, has the added benefit of being able to stall enemy warjacks, making them easier to hit and unable to run or charge. Its spiked shield provides increased protection and a secondary weapon in close combat. Simple, but effective, the Talon will remain a staple of mercenary and freelance forces for many years to come.<br><br><strong>SPD: <\/strong>6 <br><strong>MAT:<\/strong> 2 <br><strong> RAT:<\/strong> - <br><strong> DEF:<\/strong> 1  <br><strong>ARM:<\/strong> 4<br> <br><strong>Weapons: <\/strong>Shield, Stun Lance<br> <br><strong>Abilities and Advantages:<\/strong> Powerful Charge<br> <br>Talon warjacks can be included in the battlegroup of any Mercenary warcaster.<br> <br>The Talon, like so many other warjacks commonplace in mercenary battlegroups, is a decommissioned Cygnaran light warjack. Cygnaran technology and production advancements made the Talon obsolete as a frontline warjack. Talons quickly found their way to scrapyards, where they even more quickly found their way to the black market and mercenary armories.<br> <br>The Talon is a cheap, reliable light warjack that protects the advance of softer elements of its army. It can withstand considerable punishment with its shield and keep enemies at a distance with its stun lance. The stun lance is a precursor to Cygnar’s well-guarded cortex disruption technology and can stall the advance of enemy warjacks. When the stun lance strikes another warjack, it interferes with the ‘jack’s cortex and severely reduces its mobility.<br><br><br><strong>Vanguard Warjack<\/strong><br><br><strong>SPD: <\/strong>6 <br><strong>MAT:<\/strong> 1  <br><strong>RAT:<\/strong> 1<br><strong>DEF: <\/strong>2<br><strong>ARM:<\/strong> 4<br> <br><strong>Weapons:<\/strong> Shield Gun, Tower Shield, Guisarme<br> <br><strong>Abilities and Advantages:<\/strong> Assault, Shield Guard<br><br><br><strong>Nomad Warjack<\/strong><br><br><strong>SPD: <\/strong>5<br><strong>MAT:<\/strong> 2  <br><strong>RAT:<\/strong> 1<br><strong>DEF: <\/strong>0<br><strong>ARM:<\/strong> 4<br> <br><strong>Weapons:<\/strong> Open Fist, Battle Blade<br> <br><strong>Abilities and Advantages:<\/strong> N\/A<br><br><br><strong>Steelhead Rifleman<\/strong><br><br><i>“You bought the bullets whether I use them or not.”<\/i><br><br>Working in concert with other Steelheads, or the regular forces of a client army, the Steelhead Riflemen are skilled shooters capable of decimating enemy lines or providing covering fire to ensure that their allies reach the enemy in one piece. Every rifleman is a solid marksman, but when ordered to concentrate their fire at a single target they become truly deadly.<br><br><strong>SPD: <\/strong>6  <br><strong>MAT: <\/strong>1  <br><strong>RAT: <\/strong>1  <br><strong>DEF: <\/strong>2 <br><strong>ARM: <\/strong>1<br> <br><strong>Weapons: <\/strong>Sword, Military Rifle<br> <br><strong>Abilities and Advantages: <\/strong>Combined Ranged Attack, Take a Knee<br> <br>Steelhead Riflemen will work for Cryx, Cygnar, Khador, and the Protectorate of Menoth.<br> <br>As the most well-known and accessible mercenary charter in the Iron Kingdoms, the Steelhead Mercenary Company wages war with an unparalleled dedication to combined arms. Steelhead Halberdiers march across the battlefield in disciplined formations hedging in enemy formations to received devastating Steelhead Cavalry charges. While mercenary warjacks pursue hard targets, the Steelhead Riflemen units cover the melee elements as they maneuver into position with ranged fire. Riflemen go through the rigorous training and drilling that all branches of the Steelheads do. In addition, they receive incentives to conserve ammunition. As long as it does not violate the terms of the contract of employment, they will fire just enough bullets to fulfill their battlefield role.<br> <br>Steelhead Riflemen are able to quickly move around the battlefield and achieve stable firing positions to increase their accuracy. Though this may cost them some mobility subsequently, it allows them to make crucial shots when they matter. Steelhead Riflemen can combine their firepower against heavier targets when operating without warjack support.<br><br><br><strong>Steelhead Halberdier<\/strong><br><br><i>“I’m yours until the coin runs out.”<\/i><br><br>For the right price, the Steelhead Mercenary Company can bring more soldiers to bear than any other. Halberdiers are the core of that company, and wielding a simple but effective pole arm, these mercenary soldiers can bring down more sophisticated enemies with astonishing efficiency.<br><br><strong>SPD:<\/strong> 6  <br><strong>MAT: <\/strong>1  <br><strong>RAT:<\/strong> -  <br><strong>DEF:<\/strong> 2 <br><strong>ARM: <\/strong>1<br> <br><strong>Weapons: <\/strong>Halberd<br> <br><strong>Abilities and Advantages: <\/strong>Combined Melee Attack, Powerful Charge, Pike Hedge, Set Defense<br> <br>Steelhead Halberdiers will work for Cryx, Cygnar, Khador, and the Protectorate of Menoth.<br> <br>The Steelhead Mercenary Company is the most widespread and reliable mercenary company in the Iron Kingdoms. The quality of their training, tactics and soldiers has been proven time and again. Though they do not discriminate when it comes to employment, they follow their contracts and charter to the letter.<br> <br>The Steelhead Halberdiers are the mainstay of any Steelhead detachment. They comprise the bulk of the front lines and execute maneuvers with speed and precision. Fast, lightly-armored, and wielding their polearms, they can quickly move into position to receive a charging enemy. Halberdiers are able to form a hedge with their polearms that both makes them harder to hit, and affords them a preemptive attack against enemies that try to break their lines. On the offensive, the Steelhead Halberdiers coordinate their attacks to take down larger, heavily-armored targets. If Halberdiers win the initiative, they boast impressive threat and accuracy on the charge.<br><br><br><strong>Kell Bailoch<\/strong><br><br><i>“It’s just business.”<\/i><br><br>Perhaps even more notorious than sniper-for hire Kell Bailoch, is his legendary mechanika rifle, Silence. The weapon makes no report when fired, allowing its shooter to stay concealed, never giving away his position. The chilling promise of a soundless death is what every soldier fears when facing an enemy force that has contracted Bailoch.<br><br><strong>SPD: <\/strong>6  <br><strong>MAT: <\/strong>1  <br><strong>RAT:<\/strong> 4  <br><strong>DEF:<\/strong> 3 <br><strong>ARM:<\/strong> 1<br> <br><strong>Weapons: <\/strong>Sword, Silence (sniper rifle)<br> <br><strong>Abilities and Advantages:<\/strong> Dual Shot, Crippling Shot, Disabling Shot, Sniper, Prowl<br> <br>Kell Bailoch will work for Khador, and the Protectorate of Menoth.<br> <br>Kell Bailoch was a rifleman in the Cygnaran Army for a short time before he joined the infamous Black Talons mercenary company. The deeds he committed with that company, before it was discredited and disbanded, made him a deplorable individual even by the standards of tyrant Vinter Raelthorne IV. Kell has been a wanted man since Vinter’s reign and that is unlikely to change. Lucky for Kell, his value as a sniper often exceeds the value of the multitude of bounties out on his head.<br> <br>Kell Bailoch is one of the most talented marksmen in recent history. Coupled with his lack of conscience, this makes him very deadly and very sought after. Kell has mastered the ability to vanish into his surroundings to wait for the kill shot. His ability to find the chinks in armor makes him as much a threat to a soldier in full plate as a man in plain clothes. On the rare occasions Kell has a target he cannot take down easily or his employer wants alive, he can cripple a target to make it easy to catch or disable it so that it cannot use any dangerous abilities.<br><br><br><strong>Jarok Croe<\/strong><br><br><i>“No task too dirty, no task too bloody, no one untouchable.”<\/i><br><br>A notorious murderer and shameless opportunist, Jarok Croe is most valued by his clients for his effectiveness against arcanists. His mechanika pistol, Hiss, can neutralize spell casting and with his combination of stealthy movement and a poisoned blade, no target will keep Croe from his payday.<br><br><strong>SPD: <\/strong>6  <br><strong>MAT:<\/strong> 3  <br><strong>RAT:<\/strong> 2  <br><strong>DEF: <\/strong>2  <br><strong>ARM:<\/strong> 1<br><br><strong>Weapons: <\/strong>Two-handed Sword, Hiss (pistol)<br><br><strong>Abilities and Advantages:<\/strong> Stealth, Pathfinder, Bushwhack, Backstab, Poison, Track<br><br>Jarek Croe will work for Cryx, Khador, and the Protectorate of Menoth.<br><br>Jarok Croe is one of the most notorious assassins in the Iron Kingdoms. Though a mercenary, he follows only a nefarious personal code and holds no charter. Those who would hire him are only slightly less scrupulous than him. The concept of the “lone assassin” does not apply to Jarek as he has accumulated over the years a following of like-minded, would-be assassins eager to learn from him. All he ever asks in return is that they die for him. Other than that, anything goes. As a result, Jarek Croe has proved remarkably hard to kill over the years and a respectable number of his followers have been felled by enemies thinking they were Croe himself. His ability to elude Cygnaran authorities is as legendary as his tactics are deplorable.<br><br>Jarok Croe creeps across the battlefield unseen until he marks his target. All of his cutthroats coordinate around him to take down the enemies he has chosen to hunt. The targets on the battlefield he has chosen are rarely aware of his attention until a poisonous blade has been buried in their back. He seems to relish finishing off wounded foes he comes across and finishes them off with a shiv in the blink of an eye. Even spellcasters are not safe from Jarek Croe. His magelock, Hiss, stolen from his mentor that he himself slew, makes magic users unable to speak the words to erect their arcane defenses.<br><br><br><strong>Greygore Boomhowler<\/strong><br><br><i>“I’m not a fell caller, I’m a bloody legend!”<\/i><br><br>Trollkin fell callers command a power of voice that staggers the imagination, capable of invoking supernatural effects through song alone. Greygore Boomhowler claims to be the reincarnation of Bragg, the most legendary fell caller in trollkin history, revered as much for his lust of procreation, booze and battle (in that order) as for his vocal prowess. Despite being an admitted outcast of his own people, Boomhowler relentlessly works to embody this vision of Bragg, sometimes to the consternation of those who have hired him. But the effectiveness of his voice in battle is unquestionable, and those capable of tolerating Boomhowler’s bigger-than-life presence have enjoyed the distinct tactical advantage this mercenary can deliver.<br><br><strong>SPD: <\/strong>6  <br><strong>MAT:<\/strong> 3  <br><strong>RAT: <\/strong>1  <br><strong>DEF: <\/strong>1  <br><strong>ARM: <\/strong>3<br><br><strong>Weapons: <\/strong>Blunderbuss, Great Axe<br><br><strong>Abilities and Advantages: <\/strong>Combined Melee Attack, Tough, Fell Call – Call of Defiance, Fell Call – Call to Action, Fell Call – Rage Howler<br><br>Greygore Boomhowler will work for Cryx, Cygnar, Khador, and Trollbloods.<br><br>The trollkin of Western Immoren have found themselves marginalized and exploited since the time of the Orgoth. Wanting only to live the life of a trollkin, the kith and kriel of the Iron Kingdoms keep to themselves unless otherwise provoked. Greygore Boomhowler &amp; Co. are the exception. Leaving behind kith and kriel to the extent he wears a quitari tartan of his own design, Greygore and his fellow trollkin entered the realms of man to fight their battles for money and mead. To Greygore Boomhowler, this is no sacrifice. The life of a mercenary allows he and his trollkin to live a life of carousing, singing, fighting, and amorous pursuits.<br><br>Greygore Boomhowler is part of a long and powerful tradition of Fell Calling. Fell Calling is a discipline passed down from a prolific trollkin known as Bragg and many trollkin descended from him possess this power. Greygore and other descendants of Bragg can focus the trollkin voice to produce powerful effects. Greygore’s voice can lift an ally to its feet; cause he and his fellow trollkin, though already exceptionally tough, to shake off all but the most grievous wounds; or disrupt the attacks of great machines and beasts of war. Greygore also has the battle experience to combine his attacks with his allies to bring down even the most implacable foes.<br><br><br><strong>Gorman Di Wolfe<\/strong><br><br><i>“Some people say I’m mad. The rest just haven’t met me yet.”<\/i><br><br>With a reputation for mayhem even by mercenary standards, the rogue alchemist known as Gorman di Wulfe sells his services as a means to fund his controversial research. Equipped with a selection of alchemical weapons that can corrode armor, blind targets and disintegrate flesh, di Wulfe is guaranteed to leave a trail of destruction in his wake.<br><br><strong>SPD:<\/strong> 6  <br><strong>MAT:<\/strong> 1  <br><strong>RAT:<\/strong> 1  <br><strong>DEF:<\/strong> 3 <br><strong>ARM:<\/strong> 1<br> <br><strong>Weapons:<\/strong> Stiletto, Alchemical Grenades<br> <br><strong>Abilities and Advantages:<\/strong> Stealth, Immunity: Fire, Immunity: Corrosion, Alchemical Mask, Black Oil (grenade), Acid Bomb (grenade), Rust (grenade), Smoke Bombs<br> <br>Gorman di Wulfe will work for Cryx, Cygnar, Khador, and the Protectorate of Menoth.<br> <br>Gorman di Wulfe is one of the most talented alchemists in the Iron Kingdoms. He studied at the Merywyn Academy before joining the Order of the Golden Crucible. Gorman achieved Master Aurumn Ominus Alchemist in record time and no alchemical effect seemed beyond his expertise. Knowledge, like most dedicated pursuits, has a straight path as well as a dark path. It was not long before Gorman di Wulfe begain experimenting with dangerous and forbidden reagents.<br> <br>The Order of the Golden Crucible expelled Gorman di Wulfe but his journey of alchemical discovery did not stop there. He travels the Iron Kingdoms selling his deadly, alchemical skills for coin and the opportunity to test out experimental concoctions. Employers turn a blind eye to the grisly results of his experiments since none can argue with his results. Gorman creeps around the battlefield unseen, showering enemies with his most notorious mixtures: an adhesive, tarlike substance that makes targets all but helpless; a burning acid that eats through flesh, armor, and continues to eat away at the victim; and a corrosive chemical that erodes the integrity of the heaviest warjack armor.<br><br><br><strong>Eiryss, Mage Hunter of Ios<\/strong><br><br><i>“Your coin today, theirs tomorrow…”<\/i><br><br>Despite several decades of offering her skills for hire and earning her reputation through word of mouth, Eiryss is still largely a mystery to the mercenary community as well as those who hire them. Her modest fees, dispassionate professionalism, and lack of any apparent allegiance only beg the question of why she has chosen this particular trade. Some believe the money means nothing to her at all, but none would argue her value at any price. A ruthless and efficient killer, the Iosan assassin is most well known for her grim specialty: hunting and slaying Warcasters. <br><br><strong>SPD: <\/strong>7  <br><strong>MAT: <\/strong>2  <br><strong>RAT:<\/strong> 5  <br><strong>DEF:<\/strong> 4  <br><strong>ARM:<\/strong> 1<br><br><strong>Weapons:<\/strong> Saber, Bayonet, Crossbow<br><br><strong>Abilities and Advantages: <\/strong>Stealth, Pathfinder, Death Bolt, Disruptor Bolt, Phantom Seeker (crossbow bolt), Camouflage<br><br>Eiryss, Mage Hunter of Ios will work for Cygnar, Khador, and the Protectorate of Menoth. Eiryss is also a Retribution of Scyrah unit.<br><br>The nation of Ios is closed off from the rest of the Iron Kingdoms and very few outside of the elven kingdom know anything about it. From time to time, travelers from the elven nation can be seen abroad but their motives are not shared. This is not the case with Eiryss, Mage Hunter of Ios. Though reticent about her homeland, her motives in the Iron Kingdoms are clear: she will hunt down any warcaster for the right price. In truth, Eiryss would hunt down and slay every human warcaster in the Iron Kingdoms if she could. She would be reviled and hunted if this were common knowledge, so Eiryss operates under the guise of an assassin for hire and abides by the principles of mercenary conduct.<br><br>Eiryss, Mage Hunter of Ios brings the ancient and deadly battle lore of the elves to the battlefields of Immoren. Like all mage hunters, she can walk unseen until she is ready to strike. The intolerance of her people for human magic makes her unable to use her powers near warjacks, but if she is able to keep her distance, she can call on the disciplines of the mage hunter. Eiryss can fire a deadly bolt that pierces all defenses. She can also cause her shots to pass through barriers and find well hidden targets. Finally, the bane of the warcaster, she can let fly a shot that unravels a warcaster or warjack’s connection to the flow of magic. Warcasters struck by this bolt can no longer access their arcane reservoir to bolster their defenses.","about_the_game":"<strong>Magnus the Traitor<\/strong><br><br><i>“By my sword and the blood of my enemies, I will leave an immortal legacy.”<\/i><br><br>Asheth Magnus works with the inexhaustible energy of a man utterly devoted to his purpose, which is survival and revenge. Once a loyal servant of Cygnar’s deposed king, Vinter Raelthorne, Magnus now sells his services to the highest bidder as he bides his time, preparing for the return of his exiled liege. A formidable warcaster and unparalleled tactician, Magnus’ mastery of warfare is as feared as it is in demand throughout the Iron Kingdoms. <br><br><strong>SPD: <\/strong>5  <br><strong>MAT:<\/strong> 3  <br><strong>RAT:<\/strong> 1  <br><strong>MAG:<\/strong> 2  <br><strong>DEF:<\/strong> 3  <br><strong>ARM: <\/strong>3  <br><strong>FOCUS: <\/strong>6<br> <br><strong>Weapons:<\/strong> Foecleaver, Mechanikal Arm, Scattergun<br> <br><strong>Abilities and Advantages:<\/strong> Feign Death, Backstab, Resourceful<br> <br><strong>Spells: <\/strong>Arcantrik Bolt, Blur, Iron Aggression, Obliteration, Temper Metal, Snipe<br> <br><strong>Feat: <\/strong>Hit and Run<br> <br>Magnus the Traitor will work for Cryx, Khador, and the Protectorate of Menoth.<br> <br>Magnus is viewed as criminal and traitor to the majority of the population of Cygnar. Nothing could be further from the truth. A consummate patriot, every action Magnus has ever taken has been to preserve the country he loves. This includes leading a guerilla war against his former countrymen with the final goal of restoring Vinter Raelthorne IV to the throne. In terms of patriotism, it is only Magnus’ faith in the deposed despot that is questionable. Magnus now sells his skills as a commander and warcaster to any who can afford him, but he never takes a job that does not advance his underlying goal of restoring Cygnar to its former glory.<br> <br>As a product of the Cygnaran Royal Academy and a genius with mechanika rivalling the likes of Sebastian Nemo, Dominic Darius and Arlan Strangeways, Magnus the Traitor is second-to-none at supporting warjacks. At the Cygnaran Royal Academy, Magnus mastered staple spells that increase the range of his army’s guns and protect it from opposing guns and spells. On the other hand, his mechanikal genius grants him the ability to impart unparalleled aggression in his warjacks, cause any enemy warjack to seize up, and even magically temper ‘jack armor to greater resilience. When the time is right, Magnus can impart his hit-and-run tactics to his warjacks. He and his battlegroup lay waste to prime targets and are far out of reach before his enemies know what hit them.<br><br><br><strong>Drake MacBain<\/strong><br><br><strong>SPD:<\/strong>6<br><strong>MAT:<\/strong> 2  <br><strong>RAT:<\/strong> 1  <br><strong>MAG:<\/strong> 2  <br><strong>DEF:<\/strong> 4<br><strong>ARM:<\/strong> 2  <br><strong>FOCUS:<\/strong> 6<br> <br><strong>Weapons:<\/strong> Hand Cannon, Undertaker<br> <br><strong>Abilities and Advantages:<\/strong> Tough, Gang Fighter, Unyielding<br> <br><strong>Spells: <\/strong>Countermeasure, Energizer, Failsafe, Fortune, Jackhammer, Rift<br> <br><strong>Feat: <\/strong>True Grit<br><br>MacBain is a shrewd combatant willing to use every trick and improvised stratagem he can manage to assure victory. Years at war making do with whatever warjacks and men he can muster have made him an expert in exploiting his enemy’s weaknesses. He has a reputation for being a stickler with contracts and adheres to their particulars with stubborn devotion. When he signs his name to commit to a task, he delivers on that promise, and this reliability has earned him such constant work that he regularly has to turn offers away. Those who fight with him know he truly loves his job and is never happier than when extricating himself from some deadly situation.<br><br>Having grown up on the street, and having had no formal training as a Warcaster, MacBain’s selection of abilities might seem like a haphazard combination of random stuff, but, as with most Mercenary Warcasters, they all are worth more than the sum of their parts, and add to the flavor of his character as well.<br><br><br><strong>Ashlynn D'Elyse<\/strong><br><br><strong>SPD:<\/strong>6<br><strong>MAT:<\/strong> 4<br><strong>RAT:<\/strong> 2 <br><strong>MAG:<\/strong> 2  <br><strong>DEF:<\/strong> 5<br><strong>ARM:<\/strong> 2  <br><strong>FOCUS:<\/strong> 6<br> <br><strong>Weapons:<\/strong> Hand Cannon, Nemesis<br> <br><strong>Abilities and Advantages:<\/strong> Gunfighter, Parry, Quick Draw, Riposte, Virtuoso<br> <br><strong>Spells: <\/strong>Admonition, Distraction, Flashing Blade, Gallows, Quicken, Twister<br> <br><strong>Feat: <\/strong>Roulette<br><br>Before the occupation of Llael, Ashlynn grew up as a member of a noble family, receiving much training both at military academies and targeting ranges. During her adolescence, she was discovered as a Warcaster and started serving the nation. After her father was executed during the Khadoran invasion, she started doing freelance work in order to fund incursions against the Khadorans.<br><br>Ashlynn is a duelist-type character. This is seen through several aspects of her abilities, most notably her high Defense, the highest in the game, as well as some defensive passive abilities, and some impressively devastating offensive tricks. Her entire game plan revolves around sticking a pin in the wheel of the opponent’s plans and capitalizing on the mistakes caused thereby.<br><br><br><strong>Mangler Warjack<\/strong><br><br>Originally hammered together from an assortment of scrap materials, the Mangler has quickly become a favored heavy warjack chassis among the mercenary companies of the Iron Kingdoms. Equipped with a massive spiked ball of riveted iron, the Mangler can smash through enemy formations in a single swing. The huge spike on its left arm is wicked in close combat and also leaves its hand open to execute throw power-attacks, making the Mangler as versatile as it is deadly.<br><br><strong>SPD: <\/strong>5  <br><strong>MAT:<\/strong> 2  <br><strong>RAT:<\/strong> - <br><strong>DEF: <\/strong>- <br><strong>ARM:<\/strong> 4<br> <br><strong>Weapons:<\/strong> Wrecker, Punching Spike<br> <br><strong>Abilities and Advantages:<\/strong> Thresher, Open Fist<br> <br>Mangler warjacks can be included in the battlegroup of any Mercenary warcaster.<br> <br>The Mangler warjack is one of Asheth Magnus’ custom-built wonders. It is an all-comers heavy melee warjack. Much like the Renegade light warjack, Magnus bolted the first of these mechanikal bruisers together with looted ‘jack parts. With nothing but dedicated melee brutality in mind, he built the Mangler to handle any close combat situation. Since the heavy warjack does not use any of the expensive components that the Renegade does, it can be found in the battlegroups of mercenaries across the Iron Kingdoms.<br> <br>The Mangler heavy warjack has everything a battlegroup commander needs in a melee warjack. It is heavily armored and carries a massive wrecker ball so it can go toe-to-toe with other heavies. The Wrecker is attached to a long chain, allowing it to get around shields and punch through phalanxes. The Mangler can flail the Wrecker about and devastate tight infantry formations. The punching spike on the back of its other arm is a credible secondary threat that also leaves the Mangler’s fist free to grab hold of enemies.<br><br><br><strong>Renegade Warjack<\/strong><br><br>Asheth Magnus’ magnum opus is a testament to his intuitive skill with mechanika. Based on the chassis of decommissioned Cygnaran ‘jacks, the Renegade exemplifies Magnus’ approach to war: overwhelming aggression accompanied by a total commitment to each battle. Armed with a savage chain-driven shredder scrapsaw and a one-shot obliterator rocket, whose powerful concussive blasts are able to toss troops like ragdolls, the Renegade is devastating in both close combat and from afar. But its most valuable feature is its arc node, allowing Magnus to channel spells from a distance — a coveted ability unique among mercenaries in the Iron Kingdoms.<br><br><strong>SPD: <\/strong>5  <br><strong>MAT: <\/strong>2  <br><strong>RAT: <\/strong>2  <br><strong>DEF:<\/strong> -  <br><strong>ARM:<\/strong> 4<br> <br>Weapons: Shredder, Obliterator (rocket)<br> <br>Abilities and Advantages: Arc Node<br> <br>Renegade warjacks can be included in the battlegroup of Magnus.<br> <br>The Renegade light warjack is testament to the ingenuity of Asheth Magnus. These amazing light warjacks are never seen outside of a battlegroup controlled by Magnus. He would have to lose an engagement where one was left intact for anyone else to get their hands on one. If Magnus still has a Renegade intact, he probably is not losing. After cobbling the first Renegades together out of battlefield salvage, Magnus, through lucrative employment and personal opportunities, acquired the resources for dedicated production of Renegades and his other custom warjacks.<br> <br>Arc nodes are normally only available to the greatest, wealthiest kingdoms. Even the prodigious means and resources of the Steelhead Mercenary Company do not afford them access to warjacks with Arc Nodes unless they have a contract with Magnus. Magnus’ mechanikal ability includes the ability to build arc nodes from scratch if necessary, allowing him to incorporate them in the design of the Renegade. The Renegade allows Magnus to support his warjacks and armies from tactical, unassailable positions before and after the Renegade delivers its deadly payload. The Renegade’s ranged weapon is an expensive, one-shot alchemical wonder that knocks anything within its blast radius into the dirt. Whatever is still moving has to face the Renegade’s whirring chain blade that, once it bites, saws metal or bone to bits.<br><br><br><strong>Talon Warjack<\/strong><br><br>Originally developed as a frontline Cygnaran warjack, the Talon is a common sight in today’s black markets and salvage yards. Though retired from the Cygnaran armory in favor of more technologically advanced chassis, the Talon remains a favorite among mercenary companies for its reliable effectiveness in almost any situation. The Talon’s Stun Lance, while lethal against soldiers, has the added benefit of being able to stall enemy warjacks, making them easier to hit and unable to run or charge. Its spiked shield provides increased protection and a secondary weapon in close combat. Simple, but effective, the Talon will remain a staple of mercenary and freelance forces for many years to come.<br><br><strong>SPD: <\/strong>6 <br><strong>MAT:<\/strong> 2 <br><strong> RAT:<\/strong> - <br><strong> DEF:<\/strong> 1  <br><strong>ARM:<\/strong> 4<br> <br><strong>Weapons: <\/strong>Shield, Stun Lance<br> <br><strong>Abilities and Advantages:<\/strong> Powerful Charge<br> <br>Talon warjacks can be included in the battlegroup of any Mercenary warcaster.<br> <br>The Talon, like so many other warjacks commonplace in mercenary battlegroups, is a decommissioned Cygnaran light warjack. Cygnaran technology and production advancements made the Talon obsolete as a frontline warjack. Talons quickly found their way to scrapyards, where they even more quickly found their way to the black market and mercenary armories.<br> <br>The Talon is a cheap, reliable light warjack that protects the advance of softer elements of its army. It can withstand considerable punishment with its shield and keep enemies at a distance with its stun lance. The stun lance is a precursor to Cygnar’s well-guarded cortex disruption technology and can stall the advance of enemy warjacks. When the stun lance strikes another warjack, it interferes with the ‘jack’s cortex and severely reduces its mobility.<br><br><br><strong>Vanguard Warjack<\/strong><br><br><strong>SPD: <\/strong>6 <br><strong>MAT:<\/strong> 1  <br><strong>RAT:<\/strong> 1<br><strong>DEF: <\/strong>2<br><strong>ARM:<\/strong> 4<br> <br><strong>Weapons:<\/strong> Shield Gun, Tower Shield, Guisarme<br> <br><strong>Abilities and Advantages:<\/strong> Assault, Shield Guard<br><br><br><strong>Nomad Warjack<\/strong><br><br><strong>SPD: <\/strong>5<br><strong>MAT:<\/strong> 2  <br><strong>RAT:<\/strong> 1<br><strong>DEF: <\/strong>0<br><strong>ARM:<\/strong> 4<br> <br><strong>Weapons:<\/strong> Open Fist, Battle Blade<br> <br><strong>Abilities and Advantages:<\/strong> N\/A<br><br><br><strong>Steelhead Rifleman<\/strong><br><br><i>“You bought the bullets whether I use them or not.”<\/i><br><br>Working in concert with other Steelheads, or the regular forces of a client army, the Steelhead Riflemen are skilled shooters capable of decimating enemy lines or providing covering fire to ensure that their allies reach the enemy in one piece. Every rifleman is a solid marksman, but when ordered to concentrate their fire at a single target they become truly deadly.<br><br><strong>SPD: <\/strong>6  <br><strong>MAT: <\/strong>1  <br><strong>RAT: <\/strong>1  <br><strong>DEF: <\/strong>2 <br><strong>ARM: <\/strong>1<br> <br><strong>Weapons: <\/strong>Sword, Military Rifle<br> <br><strong>Abilities and Advantages: <\/strong>Combined Ranged Attack, Take a Knee<br> <br>Steelhead Riflemen will work for Cryx, Cygnar, Khador, and the Protectorate of Menoth.<br> <br>As the most well-known and accessible mercenary charter in the Iron Kingdoms, the Steelhead Mercenary Company wages war with an unparalleled dedication to combined arms. Steelhead Halberdiers march across the battlefield in disciplined formations hedging in enemy formations to received devastating Steelhead Cavalry charges. While mercenary warjacks pursue hard targets, the Steelhead Riflemen units cover the melee elements as they maneuver into position with ranged fire. Riflemen go through the rigorous training and drilling that all branches of the Steelheads do. In addition, they receive incentives to conserve ammunition. As long as it does not violate the terms of the contract of employment, they will fire just enough bullets to fulfill their battlefield role.<br> <br>Steelhead Riflemen are able to quickly move around the battlefield and achieve stable firing positions to increase their accuracy. Though this may cost them some mobility subsequently, it allows them to make crucial shots when they matter. Steelhead Riflemen can combine their firepower against heavier targets when operating without warjack support.<br><br><br><strong>Steelhead Halberdier<\/strong><br><br><i>“I’m yours until the coin runs out.”<\/i><br><br>For the right price, the Steelhead Mercenary Company can bring more soldiers to bear than any other. Halberdiers are the core of that company, and wielding a simple but effective pole arm, these mercenary soldiers can bring down more sophisticated enemies with astonishing efficiency.<br><br><strong>SPD:<\/strong> 6  <br><strong>MAT: <\/strong>1  <br><strong>RAT:<\/strong> -  <br><strong>DEF:<\/strong> 2 <br><strong>ARM: <\/strong>1<br> <br><strong>Weapons: <\/strong>Halberd<br> <br><strong>Abilities and Advantages: <\/strong>Combined Melee Attack, Powerful Charge, Pike Hedge, Set Defense<br> <br>Steelhead Halberdiers will work for Cryx, Cygnar, Khador, and the Protectorate of Menoth.<br> <br>The Steelhead Mercenary Company is the most widespread and reliable mercenary company in the Iron Kingdoms. The quality of their training, tactics and soldiers has been proven time and again. Though they do not discriminate when it comes to employment, they follow their contracts and charter to the letter.<br> <br>The Steelhead Halberdiers are the mainstay of any Steelhead detachment. They comprise the bulk of the front lines and execute maneuvers with speed and precision. Fast, lightly-armored, and wielding their polearms, they can quickly move into position to receive a charging enemy. Halberdiers are able to form a hedge with their polearms that both makes them harder to hit, and affords them a preemptive attack against enemies that try to break their lines. On the offensive, the Steelhead Halberdiers coordinate their attacks to take down larger, heavily-armored targets. If Halberdiers win the initiative, they boast impressive threat and accuracy on the charge.<br><br><br><strong>Kell Bailoch<\/strong><br><br><i>“It’s just business.”<\/i><br><br>Perhaps even more notorious than sniper-for hire Kell Bailoch, is his legendary mechanika rifle, Silence. The weapon makes no report when fired, allowing its shooter to stay concealed, never giving away his position. The chilling promise of a soundless death is what every soldier fears when facing an enemy force that has contracted Bailoch.<br><br><strong>SPD: <\/strong>6  <br><strong>MAT: <\/strong>1  <br><strong>RAT:<\/strong> 4  <br><strong>DEF:<\/strong> 3 <br><strong>ARM:<\/strong> 1<br> <br><strong>Weapons: <\/strong>Sword, Silence (sniper rifle)<br> <br><strong>Abilities and Advantages:<\/strong> Dual Shot, Crippling Shot, Disabling Shot, Sniper, Prowl<br> <br>Kell Bailoch will work for Khador, and the Protectorate of Menoth.<br> <br>Kell Bailoch was a rifleman in the Cygnaran Army for a short time before he joined the infamous Black Talons mercenary company. The deeds he committed with that company, before it was discredited and disbanded, made him a deplorable individual even by the standards of tyrant Vinter Raelthorne IV. Kell has been a wanted man since Vinter’s reign and that is unlikely to change. Lucky for Kell, his value as a sniper often exceeds the value of the multitude of bounties out on his head.<br> <br>Kell Bailoch is one of the most talented marksmen in recent history. Coupled with his lack of conscience, this makes him very deadly and very sought after. Kell has mastered the ability to vanish into his surroundings to wait for the kill shot. His ability to find the chinks in armor makes him as much a threat to a soldier in full plate as a man in plain clothes. On the rare occasions Kell has a target he cannot take down easily or his employer wants alive, he can cripple a target to make it easy to catch or disable it so that it cannot use any dangerous abilities.<br><br><br><strong>Jarok Croe<\/strong><br><br><i>“No task too dirty, no task too bloody, no one untouchable.”<\/i><br><br>A notorious murderer and shameless opportunist, Jarok Croe is most valued by his clients for his effectiveness against arcanists. His mechanika pistol, Hiss, can neutralize spell casting and with his combination of stealthy movement and a poisoned blade, no target will keep Croe from his payday.<br><br><strong>SPD: <\/strong>6  <br><strong>MAT:<\/strong> 3  <br><strong>RAT:<\/strong> 2  <br><strong>DEF: <\/strong>2  <br><strong>ARM:<\/strong> 1<br><br><strong>Weapons: <\/strong>Two-handed Sword, Hiss (pistol)<br><br><strong>Abilities and Advantages:<\/strong> Stealth, Pathfinder, Bushwhack, Backstab, Poison, Track<br><br>Jarek Croe will work for Cryx, Khador, and the Protectorate of Menoth.<br><br>Jarok Croe is one of the most notorious assassins in the Iron Kingdoms. Though a mercenary, he follows only a nefarious personal code and holds no charter. Those who would hire him are only slightly less scrupulous than him. The concept of the “lone assassin” does not apply to Jarek as he has accumulated over the years a following of like-minded, would-be assassins eager to learn from him. All he ever asks in return is that they die for him. Other than that, anything goes. As a result, Jarek Croe has proved remarkably hard to kill over the years and a respectable number of his followers have been felled by enemies thinking they were Croe himself. His ability to elude Cygnaran authorities is as legendary as his tactics are deplorable.<br><br>Jarok Croe creeps across the battlefield unseen until he marks his target. All of his cutthroats coordinate around him to take down the enemies he has chosen to hunt. The targets on the battlefield he has chosen are rarely aware of his attention until a poisonous blade has been buried in their back. He seems to relish finishing off wounded foes he comes across and finishes them off with a shiv in the blink of an eye. Even spellcasters are not safe from Jarek Croe. His magelock, Hiss, stolen from his mentor that he himself slew, makes magic users unable to speak the words to erect their arcane defenses.<br><br><br><strong>Greygore Boomhowler<\/strong><br><br><i>“I’m not a fell caller, I’m a bloody legend!”<\/i><br><br>Trollkin fell callers command a power of voice that staggers the imagination, capable of invoking supernatural effects through song alone. Greygore Boomhowler claims to be the reincarnation of Bragg, the most legendary fell caller in trollkin history, revered as much for his lust of procreation, booze and battle (in that order) as for his vocal prowess. Despite being an admitted outcast of his own people, Boomhowler relentlessly works to embody this vision of Bragg, sometimes to the consternation of those who have hired him. But the effectiveness of his voice in battle is unquestionable, and those capable of tolerating Boomhowler’s bigger-than-life presence have enjoyed the distinct tactical advantage this mercenary can deliver.<br><br><strong>SPD: <\/strong>6  <br><strong>MAT:<\/strong> 3  <br><strong>RAT: <\/strong>1  <br><strong>DEF: <\/strong>1  <br><strong>ARM: <\/strong>3<br><br><strong>Weapons: <\/strong>Blunderbuss, Great Axe<br><br><strong>Abilities and Advantages: <\/strong>Combined Melee Attack, Tough, Fell Call – Call of Defiance, Fell Call – Call to Action, Fell Call – Rage Howler<br><br>Greygore Boomhowler will work for Cryx, Cygnar, Khador, and Trollbloods.<br><br>The trollkin of Western Immoren have found themselves marginalized and exploited since the time of the Orgoth. Wanting only to live the life of a trollkin, the kith and kriel of the Iron Kingdoms keep to themselves unless otherwise provoked. Greygore Boomhowler &amp; Co. are the exception. Leaving behind kith and kriel to the extent he wears a quitari tartan of his own design, Greygore and his fellow trollkin entered the realms of man to fight their battles for money and mead. To Greygore Boomhowler, this is no sacrifice. The life of a mercenary allows he and his trollkin to live a life of carousing, singing, fighting, and amorous pursuits.<br><br>Greygore Boomhowler is part of a long and powerful tradition of Fell Calling. Fell Calling is a discipline passed down from a prolific trollkin known as Bragg and many trollkin descended from him possess this power. Greygore and other descendants of Bragg can focus the trollkin voice to produce powerful effects. Greygore’s voice can lift an ally to its feet; cause he and his fellow trollkin, though already exceptionally tough, to shake off all but the most grievous wounds; or disrupt the attacks of great machines and beasts of war. Greygore also has the battle experience to combine his attacks with his allies to bring down even the most implacable foes.<br><br><br><strong>Gorman Di Wolfe<\/strong><br><br><i>“Some people say I’m mad. The rest just haven’t met me yet.”<\/i><br><br>With a reputation for mayhem even by mercenary standards, the rogue alchemist known as Gorman di Wulfe sells his services as a means to fund his controversial research. Equipped with a selection of alchemical weapons that can corrode armor, blind targets and disintegrate flesh, di Wulfe is guaranteed to leave a trail of destruction in his wake.<br><br><strong>SPD:<\/strong> 6  <br><strong>MAT:<\/strong> 1  <br><strong>RAT:<\/strong> 1  <br><strong>DEF:<\/strong> 3 <br><strong>ARM:<\/strong> 1<br> <br><strong>Weapons:<\/strong> Stiletto, Alchemical Grenades<br> <br><strong>Abilities and Advantages:<\/strong> Stealth, Immunity: Fire, Immunity: Corrosion, Alchemical Mask, Black Oil (grenade), Acid Bomb (grenade), Rust (grenade), Smoke Bombs<br> <br>Gorman di Wulfe will work for Cryx, Cygnar, Khador, and the Protectorate of Menoth.<br> <br>Gorman di Wulfe is one of the most talented alchemists in the Iron Kingdoms. He studied at the Merywyn Academy before joining the Order of the Golden Crucible. Gorman achieved Master Aurumn Ominus Alchemist in record time and no alchemical effect seemed beyond his expertise. Knowledge, like most dedicated pursuits, has a straight path as well as a dark path. It was not long before Gorman di Wulfe begain experimenting with dangerous and forbidden reagents.<br> <br>The Order of the Golden Crucible expelled Gorman di Wulfe but his journey of alchemical discovery did not stop there. He travels the Iron Kingdoms selling his deadly, alchemical skills for coin and the opportunity to test out experimental concoctions. Employers turn a blind eye to the grisly results of his experiments since none can argue with his results. Gorman creeps around the battlefield unseen, showering enemies with his most notorious mixtures: an adhesive, tarlike substance that makes targets all but helpless; a burning acid that eats through flesh, armor, and continues to eat away at the victim; and a corrosive chemical that erodes the integrity of the heaviest warjack armor.<br><br><br><strong>Eiryss, Mage Hunter of Ios<\/strong><br><br><i>“Your coin today, theirs tomorrow…”<\/i><br><br>Despite several decades of offering her skills for hire and earning her reputation through word of mouth, Eiryss is still largely a mystery to the mercenary community as well as those who hire them. Her modest fees, dispassionate professionalism, and lack of any apparent allegiance only beg the question of why she has chosen this particular trade. Some believe the money means nothing to her at all, but none would argue her value at any price. A ruthless and efficient killer, the Iosan assassin is most well known for her grim specialty: hunting and slaying Warcasters. <br><br><strong>SPD: <\/strong>7  <br><strong>MAT: <\/strong>2  <br><strong>RAT:<\/strong> 5  <br><strong>DEF:<\/strong> 4  <br><strong>ARM:<\/strong> 1<br><br><strong>Weapons:<\/strong> Saber, Bayonet, Crossbow<br><br><strong>Abilities and Advantages: <\/strong>Stealth, Pathfinder, Death Bolt, Disruptor Bolt, Phantom Seeker (crossbow bolt), Camouflage<br><br>Eiryss, Mage Hunter of Ios will work for Cygnar, Khador, and the Protectorate of Menoth. Eiryss is also a Retribution of Scyrah unit.<br><br>The nation of Ios is closed off from the rest of the Iron Kingdoms and very few outside of the elven kingdom know anything about it. From time to time, travelers from the elven nation can be seen abroad but their motives are not shared. This is not the case with Eiryss, Mage Hunter of Ios. Though reticent about her homeland, her motives in the Iron Kingdoms are clear: she will hunt down any warcaster for the right price. In truth, Eiryss would hunt down and slay every human warcaster in the Iron Kingdoms if she could. She would be reviled and hunted if this were common knowledge, so Eiryss operates under the guise of an assassin for hire and abides by the principles of mercenary conduct.<br><br>Eiryss, Mage Hunter of Ios brings the ancient and deadly battle lore of the elves to the battlefields of Immoren. Like all mage hunters, she can walk unseen until she is ready to strike. The intolerance of her people for human magic makes her unable to use her powers near warjacks, but if she is able to keep her distance, she can call on the disciplines of the mage hunter. Eiryss can fire a deadly bolt that pierces all defenses. She can also cause her shots to pass through barriers and find well hidden targets. Finally, the bane of the warcaster, she can let fly a shot that unravels a warcaster or warjack’s connection to the flow of magic. Warcasters struck by this bolt can no longer access their arcane reservoir to bolster their defenses.","short_description":"<strong>Magnus the Traitor (Warcaster)<\/strong><br><strong>Drake MacBain (Warcaster)<\/strong><br><strong>Ashlynn D'Elyse (Warcaster)<\/strong><br><strong>Mangler Warjack<\/strong><br><strong>Renegade Warjack<\/strong><br><strong>Talon Warjack<\/strong><br><strong>Vanguard Warjack<\/strong><br><strong>Nomad Warjack<\/strong><br><strong>Eiryss, Mage Hunter of Ios<\/strong><br><strong>Greygore Boomhowler<\/strong><br><strong>Jarok Croe<\/strong><br><strong>Cutthroat<\/strong>","fullgame":{"appid":"253510","name":"WARMACHINE: Tactics"},"supported_languages":"English<strong>*<\/strong><br><strong>*<\/strong>languages with full audio support","header_image":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/header.jpg?t=1454452176","website":"www.warmachinetactics.com","pc_requirements":{"minimum":"<strong>Minimum:<\/strong><br><ul class=\"bb_ul\"><li><strong>OS:<\/strong> Windows Vista 32\/64 bit<br><\/li><li><strong>Processor:<\/strong> 2 Ghz Quadcore or Better<br><\/li><li><strong>Memory:<\/strong> 4 GB RAM<br><\/li><li><strong>Graphics:<\/strong> Intel HD4000<br><\/li><li><strong>Network:<\/strong> Broadband Internet connection<br><\/li><li><strong>Storage:<\/strong> 30 GB available space<\/li><\/ul>","recommended":"<strong>Recommended:<\/strong><br><ul class=\"bb_ul\"><li><strong>OS:<\/strong> Windows 7 (SP1)\/8 64bit<br><\/li><li><strong>Processor:<\/strong> 2 Ghz Quadcore or Better<br><\/li><li><strong>Memory:<\/strong> 8 GB RAM<br><\/li><li><strong>Graphics:<\/strong> NVidia GTX 670\/AMD Radeon or HD 7870 w\/2GB VRAM<br><\/li><li><strong>Network:<\/strong> Broadband Internet connection<br><\/li><li><strong>Storage:<\/strong> 30 GB available space<\/li><\/ul>"},"mac_requirements":{"minimum":"<strong>Minimum:<\/strong><br><ul class=\"bb_ul\"><li><strong>OS:<\/strong> 10.9.2<br><\/li><li><strong>Processor:<\/strong> 2 Ghz Quadcore or Better<br><\/li><li><strong>Memory:<\/strong> 4 GB RAM<br><\/li><li><strong>Graphics:<\/strong> Intel HD5000<br><\/li><li><strong>Network:<\/strong> Broadband Internet connection<br><\/li><li><strong>Storage:<\/strong> 30 GB available space<\/li><\/ul>","recommended":"<strong>Recommended:<\/strong><br><ul class=\"bb_ul\"><li><strong>OS:<\/strong> 10.9.2<br><\/li><li><strong>Processor:<\/strong> 2 Ghz Quadcore or Better<br><\/li><li><strong>Memory:<\/strong> 8 GB RAM<br><\/li><li><strong>Graphics:<\/strong> NVidia GeForce GTX 780M\/AMD FirePro D300 w\/2GB VRAM<br><\/li><li><strong>Network:<\/strong> Broadband Internet connection<br><\/li><li><strong>Storage:<\/strong> 30 GB available space<\/li><\/ul>"},"linux_requirements":[],"developers":["WhiteMoon Dreams"],"publishers":[""],"price_overview":{"currency":"USD","initial":999,"final":999,"discount_percent":0},"packages":[56441],"package_groups":[{"name":"default","title":"Buy WARMACHINE: Tactics - Mercenaries Faction Bundle","description":"","selection_text":"Select a purchase option","save_text":"","display_type":0,"is_recurring_subscription":"false","subs":[{"packageid":56441,"percent_savings_text":"","percent_savings":0,"option_text":"WARMACHINE: Tactics - Mercenaries Faction Bundle - $9.99","option_description":"","can_get_free_license":"0","is_free_license":false,"price_in_cents_with_discount":999}]}],"platforms":{"windows":true,"mac":true,"linux":false},"categories":[{"id":2,"description":"Single-player"},{"id":1,"description":"Multi-player"},{"id":27,"description":"Cross-Platform Multiplayer"},{"id":21,"description":"Downloadable Content"},{"id":22,"description":"Steam Achievements"},{"id":29,"description":"Steam Trading Cards"},{"id":18,"description":"Partial Controller Support"},{"id":25,"description":"Steam Leaderboards"}],"genres":[{"id":"23","description":"Indie"},{"id":"2","description":"Strategy"}],"screenshots":[{"id":0,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_df48a4c8d72e443b3bc2e3a88d5fcb07ce08eb84.600x338.jpg?t=1454452176","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_df48a4c8d72e443b3bc2e3a88d5fcb07ce08eb84.1920x1080.jpg?t=1454452176"},{"id":1,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_2c3728642fd768623d8929d91c887e7fec95a94f.600x338.jpg?t=1454452176","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_2c3728642fd768623d8929d91c887e7fec95a94f.1920x1080.jpg?t=1454452176"},{"id":2,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_a2d4cdd90ddd4c26d2ea8b5ed8f3e0971f1d2ed6.600x338.jpg?t=1454452176","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_a2d4cdd90ddd4c26d2ea8b5ed8f3e0971f1d2ed6.1920x1080.jpg?t=1454452176"},{"id":3,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_185d54831df123d04c130e2be7404c76b3789c70.600x338.jpg?t=1454452176","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_185d54831df123d04c130e2be7404c76b3789c70.1920x1080.jpg?t=1454452176"},{"id":4,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_b8d5a591c8c1cfbfe3f78c3189b080eb4d697c6e.600x338.jpg?t=1454452176","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_b8d5a591c8c1cfbfe3f78c3189b080eb4d697c6e.1920x1080.jpg?t=1454452176"},{"id":5,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_fe93d777487eadfdc925af2723f3322944bd9de3.600x338.jpg?t=1454452176","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_fe93d777487eadfdc925af2723f3322944bd9de3.1920x1080.jpg?t=1454452176"},{"id":6,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_ac205c1087c1acb6a721ab06aa4b14db6d3a179c.600x338.jpg?t=1454452176","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_ac205c1087c1acb6a721ab06aa4b14db6d3a179c.1920x1080.jpg?t=1454452176"},{"id":7,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_2d67e2ba89b2400e4cd6f1d5e78c02fdc97c0f93.600x338.jpg?t=1454452176","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_2d67e2ba89b2400e4cd6f1d5e78c02fdc97c0f93.1920x1080.jpg?t=1454452176"},{"id":8,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_e7f0e632254833f8e164ed83e23ae5feebd55ea2.600x338.jpg?t=1454452176","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_e7f0e632254833f8e164ed83e23ae5feebd55ea2.1920x1080.jpg?t=1454452176"},{"id":9,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_eef6973482ccaf89ae8beceef9f5b6233870e624.600x338.jpg?t=1454452176","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_eef6973482ccaf89ae8beceef9f5b6233870e624.1920x1080.jpg?t=1454452176"},{"id":10,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_0dd1fca3705e4c5cd6784ff9264ce67fcb34ad7f.600x338.jpg?t=1454452176","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_0dd1fca3705e4c5cd6784ff9264ce67fcb34ad7f.1920x1080.jpg?t=1454452176"},{"id":11,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_f8b14cf7f477919a7bd1a3881b9975b77d058e77.600x338.jpg?t=1454452176","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_f8b14cf7f477919a7bd1a3881b9975b77d058e77.1920x1080.jpg?t=1454452176"},{"id":12,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_3efff53b1c520c62346cd1ac1fd41e4f03c86df7.600x338.jpg?t=1454452176","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_3efff53b1c520c62346cd1ac1fd41e4f03c86df7.1920x1080.jpg?t=1454452176"},{"id":13,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_90f08cb1e19bb3ee94b801ed9732a7959f241285.600x338.jpg?t=1454452176","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_90f08cb1e19bb3ee94b801ed9732a7959f241285.1920x1080.jpg?t=1454452176"},{"id":14,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_d6c1112ac6df8e7528939cb6c55e076e387cba78.600x338.jpg?t=1454452176","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_d6c1112ac6df8e7528939cb6c55e076e387cba78.1920x1080.jpg?t=1454452176"},{"id":15,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_936670e13da02bf7cc9bf0a3da5e241ee5feb12d.600x338.jpg?t=1454452176","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_936670e13da02bf7cc9bf0a3da5e241ee5feb12d.1920x1080.jpg?t=1454452176"},{"id":16,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_ed078e481989b505c8f2a9725eb3aab59d9ca277.600x338.jpg?t=1454452176","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_ed078e481989b505c8f2a9725eb3aab59d9ca277.1920x1080.jpg?t=1454452176"},{"id":17,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_57a1f533ac3bbc19b27daf4c45ef520dedb0eb29.600x338.jpg?t=1454452176","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_57a1f533ac3bbc19b27daf4c45ef520dedb0eb29.1920x1080.jpg?t=1454452176"},{"id":18,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_f2a58aa551b588ba0ba98c462e3f5feb7ee6407f.600x338.jpg?t=1454452176","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_f2a58aa551b588ba0ba98c462e3f5feb7ee6407f.1920x1080.jpg?t=1454452176"},{"id":19,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_b8d5a591c8c1cfbfe3f78c3189b080eb4d697c6e.600x338.jpg?t=1454452176","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_b8d5a591c8c1cfbfe3f78c3189b080eb4d697c6e.1920x1080.jpg?t=1454452176"},{"id":20,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_b8d5a591c8c1cfbfe3f78c3189b080eb4d697c6e.600x338.jpg?t=1454452176","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/ss_b8d5a591c8c1cfbfe3f78c3189b080eb4d697c6e.1920x1080.jpg?t=1454452176"}],"release_date":{"coming_soon":false,"date":"Jan 14, 2015"},"support_info":{"url":"forums.whitemoondreams.com","email":"techsupport@whitemoondreams.com"},"background":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/338518\/page_bg_generated_v6b.jpg?t=1454452176"}}}