{"546120":{"success":true,"data":{"type":"game","name":"Pursuit of Power® 2","steam_appid":546120,"required_age":0,"is_free":false,"detailed_description":"<h2 class=\"bb_tag\">Features<\/h2><ul class=\"bb_ul\"><li> Real-time strategy game with pixel art<br><\/li><li> Play a Shadow Knight, Stalker, or Mage as your leader class<br><\/li><li> Choose from a variety of upgrades as your leader gains levels<br><\/li><li> Command elite troops with strategic roles and a rage mechanic<br><\/li><li> Manage connections between fortresses in a unique way<br><\/li><li> Gain prestige by defeating raid encounters spawned from rifts<br><\/li><li> Dynamic world events such as invaders that attack fortresses<br><\/li><li> Win by capturing all enemy fortresses or surviving the Apocalypse<br><\/li><li> Single-player campaign with a story and objectives<br><\/li><li> Single and multi-player skirmish (local or network)<\/li><\/ul><br><img src=\"http:\/\/cdn.edgecast.steamstatic.com\/steam\/apps\/546120\/extras\/Lich_Genie_Gazer_Demon.png?t=1485806457\"><br><br><strong>Pursuit of Power® 2<\/strong> is a real-time strategy game with a different focus than traditional RTS games. Players connect fortresses together in order to build, research technology, generate bonus resources, defend allies, and lay siege to enemies. Each player has a leader unit that summons structures and casts powerful abilities. Rifts between opposing fortresses can spawn raid encounters that reward players with prestige when defeated. There is a priority system for enemy targets and a rage mechanic that affects combat in multiple ways.<br><br>Fight through a single-player campaign game with unique content and objectives for your leader. Play local and network skirmish games with up to 10 players. Join a team with allies that can come to your aid. Create new skirmish games using a map editor with a rich set of features.<h2 class=\"bb_tag\">Current progress<\/h2>After four years of effort, Pursuit of Power® 2 is now entering the Beta phase of development. Most of the major game components have already been completed. That includes the path-finding, troop AI, computer player AI, networking, multiplayer, game editor, combat mechanics, fortresses, and other major components.<br><br><br>The main features I need to finish implementing are rift events, the leveling system, Steam integration, and the campaign mode. Those 4 items will be my priority over the next few months. The artwork is in progress and I expect to continue adding new assets for many months. The game will continue to look more visually interesting, especially once I begin adding unique combat effects for each unit. The level of polish will dramatically increase too.<br><br><strong>I am launching the Steam store early, so I can begin building a community around the game. I will update the store during development, especially when I add new content and features to the game. Also, Steam trading cards will be created prior to release.<\/strong><h2 class=\"bb_tag\">Gameplay<\/h2>The game begins with your chosen leader spawning next to a crystal formation. Clicking on the crystal will summon your first fortress over it. Now you must race across the map to summon more fortresses over unprotected crystal formations using your leader and zealots.<br><br><img src=\"http:\/\/cdn.edgecast.steamstatic.com\/steam\/apps\/546120\/extras\/Fortress-Portals.png?t=1485806457\"><br><i>Portals are summoned over crystal formations<\/i><br><br><strong>What are zealots?<\/strong> They are devout followers that march from your own fortresses to any other fortress, whether friendly or an enemy. Zealots form a continuous line when there are no gaps between zealots due to deaths. Those complete connections transfer magical power that can generate resources, bolster defenses, or help lay siege to enemy fortresses.<br><br>The front zealot at the head of the line holds a banner. If any zealot dies before it, then the banner shifts to the next head of the continuous line. Power emanates from the banner during each pulse event. When connected to a friendly fortress, that power flows through it and travels back to the source, providing additional power for the player. The destination fortress also receives increased build progress for every friendly connection.<br><br>On the other hand, every enemy zealot connection to a fortress slows its build progress. If more enemy banner zealots reach the fortress than friendly zealots, it essentially halts progress so enemy troops can lay siege. In addition, the enemy banner zealots generate prestige when they successfully reach the portal.<br><br><strong>What are the resources?<\/strong> Every 2 seconds a pulse event occurs in the game. During that event, power is generated for players with fortresses over active crystal formations. Power is the main resource in the game. It is required for most game actions, such as summoning troops or using an ability.<br><br><img src=\"http:\/\/cdn.edgecast.steamstatic.com\/steam\/apps\/546120\/extras\/Crystal_Animation.png?t=1485806457\"><br><i>Crystal formations generate power for players<\/i><br><br>Prestige is awarded for heroic actions against enemies. It can be gained when players connect their zealots to enemy fortresses, use leader abilities effectively, destroy enemy zealots, kill enemy leaders, kill rift invaders, defeat rift events, or capture enemy fortresses. Prestige is required for some of the most powerful game actions, including the leveling system.<br><br><img src=\"http:\/\/cdn.edgecast.steamstatic.com\/steam\/apps\/546120\/extras\/Towers-Tier2.png?t=1485806457\"><br><i>These units generate prestige when they kill zealots<\/i><br><br><strong>How does the leveling system work?<\/strong> Leaders gain levels as prestige is accumulated, much like experience in a traditional RPG. Every new level will award 3 ability points that can be spent on improving your leader. The system is similar to Alternate Advancement (AA) points in EverQuest.<br><br><img src=\"http:\/\/cdn.edgecast.steamstatic.com\/steam\/apps\/546120\/extras\/Mage_Attack.png?t=1485806457\"><br><i>Mage leader casting a spell<\/i><br><br>There are 10 abilities that can be upgraded 3 times, where each upgrade tier costs that many points (1-2-3). So it takes 6 total points to fully upgrade an ability. The abilities are grouped into 4 categories, and a new category group is unlocked every 5 levels.<br><br>Those ability groups are tied to different phases of the game. Four of the main combat abilities are available immediately in the first group. The second group of 3 avatar abilities help defeat rift events. The third group of 2 divine abilities can wreak havoc on enemy zealots and fortresses. The final group consists of a single leader aura with powerful effects.<br><br><img src=\"http:\/\/cdn.edgecast.steamstatic.com\/steam\/apps\/546120\/extras\/Rifts_Image.png?t=1485806457\"><br><br><strong>What is a rift event?<\/strong> Rifts are created when crystal formations become unstable. They start to form between opposing fortresses after players have claimed all crystal formations, or a certain amount of time has passed. They spawn invaders that attack fortresses, and during periodic surges, can overwhelm the fortress until it has been destroyed.<br><br>Players can also trigger a rift event by using their leader's special divine ability on any rift. That player is then &quot;in phase&quot; with the rift event and can therefore damage the enemies it spawns. Other players can still attack the triggering player's troops, so it can be a chaotic battle. However, any player not &quot;in phase&quot; will be attacked with extra damage if those troops get too close to the creatures spawned from the rift.<br><br>Several waves of enemies will spawn from the rift. Prestige is awarded when the final boss wave has been defeated. No prestige is awarded if the leader dies, moves out of range, or a certain amount of time passes. The ability used to trigger the event has a cool-down timer once the rift event ends.<br><br><strong>What is a typical battle scenario?<\/strong> During battles, units will select targets based on a few criteria. Towers will normally target zealots before any other unit. However, siege troops will draw fire when in range. That will allow your zealots to pass by without being harmed. The siege units are also very effective at absorbing damage from structures.<br><br><img src=\"http:\/\/cdn.edgecast.steamstatic.com\/steam\/apps\/546120\/extras\/Towers-Tier1.png?t=1485806457\"><br><i>Towers will attack siege units as a priority<\/i><br><br>Fighter units will taunt all troops when in range. That can allow your high-damage units to harm enemies without risking death. Immobilization troops can fear, stun, and mesmerize most other troops. That can render a group of enemies helpless as they get picked off. When the affected unit is first hit, a bonus buff is triggered for the attacker.<br><br><img src=\"http:\/\/cdn.edgecast.steamstatic.com\/steam\/apps\/546120\/extras\/Knight_Attack.png?t=1485806457\"><br><i>Shadow Knight leader swinging his axe<\/i><br><br>Scout units can stealth and do extra damage when attacking while hidden. They can detect other stealth units and also have a debuff. That debuff amplifies the damage of certain abilities. All 3 major debuffs are displayed as icons near the troop health and rage bars due to their importance.<br><br><img src=\"http:\/\/cdn.edgecast.steamstatic.com\/steam\/apps\/546120\/extras\/Stalker_Attack.png?t=1485806457\"><br><i>Stalker leader attacking with her bow<\/i><br><br>Rage is generated when the troop takes damage or while it is immobilized. As the rage increases, the troop gains rage levels. Each rage level multiplies the damage done by that troop. Killing troops with high levels of rage is important. Some abilities can even harness the rage to create bonus effects. Troops at max rage level are immune to immobilization effects. All troops decrease rage over time.<br><br><strong>How do you capture an enemy fortress?<\/strong> Players must first destroy all 4 fortification towers to make the portal vulnerable. Then they can damage the portal while fortifications are down, which isn't easy since fortifications can repair themselves with help from friendly zealots. The player's zealots will then capture the unprotected portal after several pulse events and a new fortress will be summoned for the conquering player.<br><br><img src=\"http:\/\/cdn.edgecast.steamstatic.com\/steam\/apps\/546120\/extras\/Fortress-Fortifications.png?t=1485806457\"><br><i>Destroy all 4 fortification towers to make portals vulnerable<\/i><br><br><strong>How does the game end?<\/strong> There are two main ways to win the game. The more traditional way is to capture all of the enemy fortresses. Leveling-up your leader more quickly than your opponents can help, especially once you gain your powerful Aura ability.<br><br>You can also win the game if you are the last player to survive the Apocalypse. The game world becomes increasingly chaotic as players conquer fortresses and destroy the rifts. Powerful creatures from an alternate dimension take notice and start to descend through the rifts, making the encounters more difficult.<br><br>When the first leader reaches max level, the game shifts to the final phase -- Apocalypse survival! All remaining fortresses come under heavy attack from the rifts, which form all over the game world. The attacks increase in strength until only one player survives and the game is won.<br><br><strong>Are there any other gameplay concepts?<\/strong> I plan to implement additional features as funding permits. Those concepts include rift storms, fortresses that morph into controllable raid bosses, flying guardians, talking avatars that provide situational awareness and commentary, droppable raid items for leaders, and more...<h2 class=\"bb_tag\">Story<\/h2>The crystal formations are an integral part of the story. They are connected together beneath the earth, forming a network of power that flows through the planet. They are a living entity, where each pulse is a breath that nourishes the planet.<br><br><br>The power of the crystals was harnessed long ago by beings that desired immortality. Those creatures absorbed so much power that they ascended to another dimension, becoming worshiped by the mortals left behind. These deities now fight for dominance as they seek to gather the strongest allies across every dimension.<br><br>You have risen to lead the mortal armies of your deity. As you conquer each world, you consume its power until you are able to transport your spirit to another world, leaving behind the remains of a diminished planet. From there you launch your assaults, summoning your armies through portals that connect those worlds.<br><br>You are aided by the Avatar of your deity, a formidable creature that can grant you god-like abilities to smite your enemies. This Avatar gives you insight into all divine beings, including the crystal formations and the zealots of your enemies. Through its omniscience, you can even sense when your fortresses are going to be attacked.<br><br>Now you must conquer each new world and harness its power to give your deity the dominance it craves. Perhaps in time, you will ascend and rule over your own empire...","about_the_game":"<h2 class=\"bb_tag\">Features<\/h2><ul class=\"bb_ul\"><li> Real-time strategy game with pixel art<br><\/li><li> Play a Shadow Knight, Stalker, or Mage as your leader class<br><\/li><li> Choose from a variety of upgrades as your leader gains levels<br><\/li><li> Command elite troops with strategic roles and a rage mechanic<br><\/li><li> Manage connections between fortresses in a unique way<br><\/li><li> Gain prestige by defeating raid encounters spawned from rifts<br><\/li><li> Dynamic world events such as invaders that attack fortresses<br><\/li><li> Win by capturing all enemy fortresses or surviving the Apocalypse<br><\/li><li> Single-player campaign with a story and objectives<br><\/li><li> Single and multi-player skirmish (local or network)<\/li><\/ul><br><img src=\"http:\/\/cdn.edgecast.steamstatic.com\/steam\/apps\/546120\/extras\/Lich_Genie_Gazer_Demon.png?t=1485806457\"><br><br><strong>Pursuit of Power® 2<\/strong> is a real-time strategy game with a different focus than traditional RTS games. Players connect fortresses together in order to build, research technology, generate bonus resources, defend allies, and lay siege to enemies. Each player has a leader unit that summons structures and casts powerful abilities. Rifts between opposing fortresses can spawn raid encounters that reward players with prestige when defeated. There is a priority system for enemy targets and a rage mechanic that affects combat in multiple ways.<br><br>Fight through a single-player campaign game with unique content and objectives for your leader. Play local and network skirmish games with up to 10 players. Join a team with allies that can come to your aid. Create new skirmish games using a map editor with a rich set of features.<h2 class=\"bb_tag\">Current progress<\/h2>After four years of effort, Pursuit of Power® 2 is now entering the Beta phase of development. Most of the major game components have already been completed. That includes the path-finding, troop AI, computer player AI, networking, multiplayer, game editor, combat mechanics, fortresses, and other major components.<br><br><br>The main features I need to finish implementing are rift events, the leveling system, Steam integration, and the campaign mode. Those 4 items will be my priority over the next few months. The artwork is in progress and I expect to continue adding new assets for many months. The game will continue to look more visually interesting, especially once I begin adding unique combat effects for each unit. The level of polish will dramatically increase too.<br><br><strong>I am launching the Steam store early, so I can begin building a community around the game. I will update the store during development, especially when I add new content and features to the game. Also, Steam trading cards will be created prior to release.<\/strong><h2 class=\"bb_tag\">Gameplay<\/h2>The game begins with your chosen leader spawning next to a crystal formation. Clicking on the crystal will summon your first fortress over it. Now you must race across the map to summon more fortresses over unprotected crystal formations using your leader and zealots.<br><br><img src=\"http:\/\/cdn.edgecast.steamstatic.com\/steam\/apps\/546120\/extras\/Fortress-Portals.png?t=1485806457\"><br><i>Portals are summoned over crystal formations<\/i><br><br><strong>What are zealots?<\/strong> They are devout followers that march from your own fortresses to any other fortress, whether friendly or an enemy. Zealots form a continuous line when there are no gaps between zealots due to deaths. Those complete connections transfer magical power that can generate resources, bolster defenses, or help lay siege to enemy fortresses.<br><br>The front zealot at the head of the line holds a banner. If any zealot dies before it, then the banner shifts to the next head of the continuous line. Power emanates from the banner during each pulse event. When connected to a friendly fortress, that power flows through it and travels back to the source, providing additional power for the player. The destination fortress also receives increased build progress for every friendly connection.<br><br>On the other hand, every enemy zealot connection to a fortress slows its build progress. If more enemy banner zealots reach the fortress than friendly zealots, it essentially halts progress so enemy troops can lay siege. In addition, the enemy banner zealots generate prestige when they successfully reach the portal.<br><br><strong>What are the resources?<\/strong> Every 2 seconds a pulse event occurs in the game. During that event, power is generated for players with fortresses over active crystal formations. Power is the main resource in the game. It is required for most game actions, such as summoning troops or using an ability.<br><br><img src=\"http:\/\/cdn.edgecast.steamstatic.com\/steam\/apps\/546120\/extras\/Crystal_Animation.png?t=1485806457\"><br><i>Crystal formations generate power for players<\/i><br><br>Prestige is awarded for heroic actions against enemies. It can be gained when players connect their zealots to enemy fortresses, use leader abilities effectively, destroy enemy zealots, kill enemy leaders, kill rift invaders, defeat rift events, or capture enemy fortresses. Prestige is required for some of the most powerful game actions, including the leveling system.<br><br><img src=\"http:\/\/cdn.edgecast.steamstatic.com\/steam\/apps\/546120\/extras\/Towers-Tier2.png?t=1485806457\"><br><i>These units generate prestige when they kill zealots<\/i><br><br><strong>How does the leveling system work?<\/strong> Leaders gain levels as prestige is accumulated, much like experience in a traditional RPG. Every new level will award 3 ability points that can be spent on improving your leader. The system is similar to Alternate Advancement (AA) points in EverQuest.<br><br><img src=\"http:\/\/cdn.edgecast.steamstatic.com\/steam\/apps\/546120\/extras\/Mage_Attack.png?t=1485806457\"><br><i>Mage leader casting a spell<\/i><br><br>There are 10 abilities that can be upgraded 3 times, where each upgrade tier costs that many points (1-2-3). So it takes 6 total points to fully upgrade an ability. The abilities are grouped into 4 categories, and a new category group is unlocked every 5 levels.<br><br>Those ability groups are tied to different phases of the game. Four of the main combat abilities are available immediately in the first group. The second group of 3 avatar abilities help defeat rift events. The third group of 2 divine abilities can wreak havoc on enemy zealots and fortresses. The final group consists of a single leader aura with powerful effects.<br><br><img src=\"http:\/\/cdn.edgecast.steamstatic.com\/steam\/apps\/546120\/extras\/Rifts_Image.png?t=1485806457\"><br><br><strong>What is a rift event?<\/strong> Rifts are created when crystal formations become unstable. They start to form between opposing fortresses after players have claimed all crystal formations, or a certain amount of time has passed. They spawn invaders that attack fortresses, and during periodic surges, can overwhelm the fortress until it has been destroyed.<br><br>Players can also trigger a rift event by using their leader's special divine ability on any rift. That player is then &quot;in phase&quot; with the rift event and can therefore damage the enemies it spawns. Other players can still attack the triggering player's troops, so it can be a chaotic battle. However, any player not &quot;in phase&quot; will be attacked with extra damage if those troops get too close to the creatures spawned from the rift.<br><br>Several waves of enemies will spawn from the rift. Prestige is awarded when the final boss wave has been defeated. No prestige is awarded if the leader dies, moves out of range, or a certain amount of time passes. The ability used to trigger the event has a cool-down timer once the rift event ends.<br><br><strong>What is a typical battle scenario?<\/strong> During battles, units will select targets based on a few criteria. Towers will normally target zealots before any other unit. However, siege troops will draw fire when in range. That will allow your zealots to pass by without being harmed. The siege units are also very effective at absorbing damage from structures.<br><br><img src=\"http:\/\/cdn.edgecast.steamstatic.com\/steam\/apps\/546120\/extras\/Towers-Tier1.png?t=1485806457\"><br><i>Towers will attack siege units as a priority<\/i><br><br>Fighter units will taunt all troops when in range. That can allow your high-damage units to harm enemies without risking death. Immobilization troops can fear, stun, and mesmerize most other troops. That can render a group of enemies helpless as they get picked off. When the affected unit is first hit, a bonus buff is triggered for the attacker.<br><br><img src=\"http:\/\/cdn.edgecast.steamstatic.com\/steam\/apps\/546120\/extras\/Knight_Attack.png?t=1485806457\"><br><i>Shadow Knight leader swinging his axe<\/i><br><br>Scout units can stealth and do extra damage when attacking while hidden. They can detect other stealth units and also have a debuff. That debuff amplifies the damage of certain abilities. All 3 major debuffs are displayed as icons near the troop health and rage bars due to their importance.<br><br><img src=\"http:\/\/cdn.edgecast.steamstatic.com\/steam\/apps\/546120\/extras\/Stalker_Attack.png?t=1485806457\"><br><i>Stalker leader attacking with her bow<\/i><br><br>Rage is generated when the troop takes damage or while it is immobilized. As the rage increases, the troop gains rage levels. Each rage level multiplies the damage done by that troop. Killing troops with high levels of rage is important. Some abilities can even harness the rage to create bonus effects. Troops at max rage level are immune to immobilization effects. All troops decrease rage over time.<br><br><strong>How do you capture an enemy fortress?<\/strong> Players must first destroy all 4 fortification towers to make the portal vulnerable. Then they can damage the portal while fortifications are down, which isn't easy since fortifications can repair themselves with help from friendly zealots. The player's zealots will then capture the unprotected portal after several pulse events and a new fortress will be summoned for the conquering player.<br><br><img src=\"http:\/\/cdn.edgecast.steamstatic.com\/steam\/apps\/546120\/extras\/Fortress-Fortifications.png?t=1485806457\"><br><i>Destroy all 4 fortification towers to make portals vulnerable<\/i><br><br><strong>How does the game end?<\/strong> There are two main ways to win the game. The more traditional way is to capture all of the enemy fortresses. Leveling-up your leader more quickly than your opponents can help, especially once you gain your powerful Aura ability.<br><br>You can also win the game if you are the last player to survive the Apocalypse. The game world becomes increasingly chaotic as players conquer fortresses and destroy the rifts. Powerful creatures from an alternate dimension take notice and start to descend through the rifts, making the encounters more difficult.<br><br>When the first leader reaches max level, the game shifts to the final phase -- Apocalypse survival! All remaining fortresses come under heavy attack from the rifts, which form all over the game world. The attacks increase in strength until only one player survives and the game is won.<br><br><strong>Are there any other gameplay concepts?<\/strong> I plan to implement additional features as funding permits. Those concepts include rift storms, fortresses that morph into controllable raid bosses, flying guardians, talking avatars that provide situational awareness and commentary, droppable raid items for leaders, and more...<h2 class=\"bb_tag\">Story<\/h2>The crystal formations are an integral part of the story. They are connected together beneath the earth, forming a network of power that flows through the planet. They are a living entity, where each pulse is a breath that nourishes the planet.<br><br><br>The power of the crystals was harnessed long ago by beings that desired immortality. Those creatures absorbed so much power that they ascended to another dimension, becoming worshiped by the mortals left behind. These deities now fight for dominance as they seek to gather the strongest allies across every dimension.<br><br>You have risen to lead the mortal armies of your deity. As you conquer each world, you consume its power until you are able to transport your spirit to another world, leaving behind the remains of a diminished planet. From there you launch your assaults, summoning your armies through portals that connect those worlds.<br><br>You are aided by the Avatar of your deity, a formidable creature that can grant you god-like abilities to smite your enemies. This Avatar gives you insight into all divine beings, including the crystal formations and the zealots of your enemies. Through its omniscience, you can even sense when your fortresses are going to be attacked.<br><br>Now you must conquer each new world and harness its power to give your deity the dominance it craves. Perhaps in time, you will ascend and rule over your own empire...","short_description":"<strong>Pursuit of Power® 2 is a fast-paced real-time strategy game with pixel art. You assume the role of a powerful leader, which can be a Shadow Knight, Stalker, or Mage. Choose ability upgrades for your leader. Dynamic world events. Manage fortresses. Campaign and skirmish (local or network).<\/strong>","supported_languages":"English","header_image":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/546120\/header.jpg?t=1485806457","website":"http:\/\/www.PursuitOfPower2.com","pc_requirements":{"minimum":"<strong>Minimum:<\/strong><br><ul class=\"bb_ul\"><li><strong>OS:<\/strong> Windows XP<br><\/li><li><strong>Memory:<\/strong> 256 MB RAM<br><\/li><li><strong>DirectX:<\/strong> Version 8.1<\/li><\/ul>"},"mac_requirements":[],"linux_requirements":[],"legal_notice":"PURSUIT OF POWER is a registered trademark of Precision Games, LLC.","developers":["Precision Games, LLC"],"publishers":["Precision Games, LLC"],"package_groups":[],"platforms":{"windows":true,"mac":false,"linux":false},"categories":[{"id":2,"description":"Single-player"},{"id":1,"description":"Multi-player"},{"id":9,"description":"Co-op"},{"id":22,"description":"Steam Achievements"},{"id":30,"description":"Steam Workshop"},{"id":23,"description":"Steam Cloud"},{"id":17,"description":"Includes level editor"}],"genres":[{"id":"1","description":"Action"},{"id":"23","description":"Indie"},{"id":"2","description":"Strategy"}],"screenshots":[{"id":0,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/546120\/ss_b8870d4be97c62bd8303d2b2952760ae0b152b16.600x338.jpg?t=1485806457","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/546120\/ss_b8870d4be97c62bd8303d2b2952760ae0b152b16.1920x1080.jpg?t=1485806457"},{"id":1,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/546120\/ss_4667a32f37c1ad3cf5dea349c38040c43d6c99c7.600x338.jpg?t=1485806457","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/546120\/ss_4667a32f37c1ad3cf5dea349c38040c43d6c99c7.1920x1080.jpg?t=1485806457"},{"id":2,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/546120\/ss_6fc2ac919dbd81d7613bfb5fe7c9fa87b0a0858f.600x338.jpg?t=1485806457","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/546120\/ss_6fc2ac919dbd81d7613bfb5fe7c9fa87b0a0858f.1920x1080.jpg?t=1485806457"},{"id":3,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/546120\/ss_3731e904938cebca0c573e7232bebe860c6017be.600x338.jpg?t=1485806457","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/546120\/ss_3731e904938cebca0c573e7232bebe860c6017be.1920x1080.jpg?t=1485806457"},{"id":4,"path_thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/546120\/ss_b1d6c58ec6c74e52acaa58c45debbe595d088f60.600x338.jpg?t=1485806457","path_full":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/546120\/ss_b1d6c58ec6c74e52acaa58c45debbe595d088f60.1920x1080.jpg?t=1485806457"}],"movies":[{"id":256678670,"name":"Pursuit of Power 2 (Start of Beta)","thumbnail":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/256678670\/movie.293x165.jpg?t=1485805186","webm":{"480":"http:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/256678670\/movie480.webm?t=1485805186","max":"http:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/256678670\/movie_max.webm?t=1485805186"},"highlight":true}],"release_date":{"coming_soon":true,"date":"March 2018"},"support_info":{"url":"http:\/\/www.precisiongames.net","email":"support@precisiongames.net"},"background":"https:\/\/steamcdn-a.akamaihd.net\/steam\/apps\/546120\/page_bg_generated_v6b.jpg?t=1485806457"}}}